{
    "execMembers": [
        {
            "firstName": "Helen",
            "fullName": "Helen verDuin Palit",
            "title": "Founder and President",
            "email": " h.palit@mapleleafharvest.org",
            "memberDescription": "As Social Entrepreneur she pioneered the global perishable food recovery system that today will feed one million people throughout 1,317 cities of the world, 8 billion meals and counting since 1981. She managed Yale University’s Dwight Hall Soup Kitchen in New Haven, CT when in 1981 she organized the first food recovery program, New Haven Food Salvage Project. Designed the perishable food distribution system in which local food producers, restaurants and caterers could donate their"
        },
        {
            "firstName": "Robert",
            "fullName": "Robert Edward Harrison",
            "title": "Board Member ",
            "email": "",
            "memberDescription": "Robert E. Harrison is a senior technical consultant, with 40 years’ experience in the field of automation systems. Having built control panels for a wide range of systems, from hydro power generation plants down to automated bakery production systems. He has developed, produced and installed computer system for corporate headquarters, sales offices to manufacturing plants and specialized departments. As a plant engineer he designed a complete manufacturing plant and all production equipment"
        },
        {
            "firstName": "Shawn",
            "fullName": "Shawn William Baker",
            "title": "Board Member ",
            "email": "",
            "memberDescription": "Since 1985, Shawn Baker has worked in the metal installation industry and founded Canadian Metal Manufacturing Inc. in 1997 by serving the construction industry in the supplying and installation of sheet metal components. In 2004 he joined the Self-Storage industry as the only Canadian manufacturer and supplier of self-storage components. 2008 Shawn organized a team of experts offering TurnKey Storage SystemsTM, integrated services from setting up to implementing functional day to day"
        },
        {
            "firstName": "Brian",
            "fullName": "Brian Leung",
            "title": "Financial Analyst ",
            "email": "",
            "memberDescription": "Brian Leung is a recent University Graduate in Business Administration. Prior to his involvement in Maple Leaf Harvest, Brian was a “top volunteer” as described in the not-for-profit industry. Brian’s logistical and numbers skills to the Maple Leaf Harvest teams.  Putting himself through college é university, Brian Leung worked in various restaurants while currently working towards his CPA, CMA designation. With MLH  he is responsible for: financial forecasting, project evaluation, and providing strategic recommendations throughout the food distribution process in order to maximize donors' value while insuring our most cost effective operations."
        },
        {
            "firstName": "John",
            "fullName": "John Carlo Puopolo",
            "title": "Operations Manager",
            "email": " j.puopolo@mapleleafharvest.org",
            "memberDescription": "John Carlo is currently working towards becoming a Chartered Professional Accountant (formerly Chartered Accountant).  Throughout the past, he has volunteered in food banks, soup kitchens and food pantries throughout the GTA.  With MLH he is responsible for: the establishment of databases of beneficiaries and donors, working with the accounting manager to complete the accounting records, preparing the financial statements and analysing thefinancial statements to improve operations."
        },
        {
            "firstName": "Kacper",
            "fullName": "Kacper Nowacki",
            "title": "Director of Administration and Development",
            "email": " k.nowacki@mapleleafharvest.org",
            "memberDescription": "At Maple Leaf Harvest responsible for the general development of the entire organization. Searches for the new opportunities for the organization to grow and deliver better quality of services. Is responsible for establishing partnerships with food donors and emergency feeding agencies. Ensures legal compliance of all the organization’s activities at state and federal levels. Coordinates preparation of new marketing materials and social media activities. Creates and implements organization’s"
        }
    ],
    "volunteers": [
        {
            "fullName": "Alexander Dimoski",
            "memberDescription": "Experienced Human Resources Manager and Mental Athlete with a Strong Curiosity, Looking to Help Others Change and Influence the World."
        },
        {
            "fullName": "Florind Metalla",
            "memberDescription": "Florind Metalla brings 4+ years of marketing experience to Maple Leaf Harvest. He is interested in making the world a better place. He is responsible for content creation and campaign management."
        },
        {
            "fullName": "Gautam Narang",
            "memberDescription": "Gautam Narang’s photography has been featured by National Geographic, Canon EOS magazine, Medium Magazine, JPG magazine and 30+ other magazines. Gautam is available for commissioned work and his demo reel can be found at https://vimeo.com/85375596.,"
        },
        {
            "fullName": "Geridyn Moreno",
            "memberDescription": "Geridyn Moreno is an artisan of the arts. However, her main focus is graphic design. She hopes to continue learning the many aspects that this field has to offer through experience in doing various projects."
        },
        {
            "fullName": "Hanee Park",
            "memberDescription": "Hanee is an independent documentary filmmaker who is curious about people and their interactions. She is excited to volunteer for MLH and to be able to work with an awesome group of passionate and talented volunteers for the very first crowd-funding project that will help start up the works of MLH."
        },
        {
            "fullName": "Junaid Ahmad",
            "memberDescription": "Junaid Ahmad is a recent graduate in Business and Marketing, using his skills to help Maple Leaf Harvest grow and reach out to those who want to help. He works with content development and getting people interested in our cause."
        },
        {
            "fullName": "Jordyn Rachel",
            "memberDescription": ""
        },
        {
            "fullName": "Larissa Reffle",
            "memberDescription": ""
        },
        {
            "fullName": "Junaid Ahmad",
            "memberDescription": ""
        },
        {
            "fullName": "Thujan Paramsothy",
            "memberDescription": ""
        }
    ]
}